--- a/docs/12-connectors/05-description/10-common-interfaces/09-attributes-interface.md
+++ b/docs/12-connectors/05-description/10-common-interfaces/09-attributes-interface.md
@@ -39,18 +37,18 @@ When you have a list of available `Attributes` supported by the `Connector`, you
 The following example is creating `Credential` object. The same approach can be used for other objects that can be created based on the `Attributes` definition and specific `Connector`.
 :::
 
-```mermaid
-sequenceDiagram
+```plantuml
+    @startuml
     autonumber
-    
-    Client->>Core: POST /v1/credentials
-    Note over Client,Core: Add Credential with Attributes
-    Core->>Core: Check existence of Connector and Credential
-    Core->>Connector: POST /v1/{functionalGroup}/{kind}/attributes/validate
-    Note over Core,Connector: Validate Attributes
-    Connector-->>Core: Return validation result
-    Core->>Core: Store Credential
-    Core-->>Client: Return Credential UUID
+    skinparam topurl https://docs.czertainly.com/api/
+        Client->>Core [[core-credential/#tag/Credential-Management-API/operation/createCredential]]: Add Credential
+        Note over Client,Core: Add Credential with specific Attributes
+        Core->>Core: Check existence of Connector and Credential
+        Core->>Connector: Validate Attributes
+        Connector-->>Core: Return validation result
+        Core->>Core: Store Credential
+        Core-->>Client: Return Credential UUID
+    @enduml
 ```
 
 ## Specification and example
